{
 "cells": [
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "1. Напишите функцию generate_password(length), которая генерирует случайный пароль заданной длины, содержащий:\n",
    "\n",
    "заглавные и строчные латинские буквы,\n",
    "\n",
    "цифры,\n",
    "\n",
    "символы !@#$%^&*.\n",
    "\n",
    "Функция должна гарантированно включать хотя бы один символ из каждой категории."
   ],
   "id": "27a50aa3df8e9c39"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "source": [
    "import random as rnd\n",
    "import string\n",
    "\n",
    "alphabet = string.ascii_letters\n",
    "\n",
    "def gen_pass(length):\n",
    "    new_pass = ''\n",
    "\n",
    "    for i in range(length):\n",
    "        rnd_let = rnd.choice(alphabet)\n",
    "        rnd_num = rnd.randint(0, 9)\n",
    "        rnd_symb = rnd.choice(\"!@#$^&*.,\")\n",
    "        new_pass += rnd_let + str(rnd_num) + rnd_symb\n",
    "    return new_pass[0:length]\n",
    "\n",
    "gen_pass(10)"
   ],
   "id": "da29564c3f60bb3c",
   "outputs": [],
   "execution_count": null
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "2.\n",
    "Напишите программу, которая запрашивает у пользователя текст и выводит:\n",
    "\n",
    "количество слов,\n",
    "\n",
    "количество уникальных слов,\n",
    "\n",
    "самое часто встречающееся слово (и сколько раз),\n",
    "\n",
    "среднюю длину слова."
   ],
   "id": "ecd99d40d0bc62d"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "source": [
    "from collections import Counter as cou\n",
    "\n",
    "stri = \"Количество слов, количество уникальных слов, количество самого часто встречающеесего слова, и сколько раз, среднюю длину слова\"\n",
    "\n",
    "def word_average(stri):\n",
    "    split_stri = stri.lower().split()\n",
    "    len_spl_st = len(split_stri)\n",
    "    set_len_spl_st = len(set(split_stri))\n",
    "    most_use = cou(split_stri).most_common(1)\n",
    "    len_word = 0\n",
    "    for i in split_stri:\n",
    "        len_word += len(i)\n",
    "    num_word = len_word / len_spl_st\n",
    "    return len_spl_st, set_len_spl_st, most_use, num_word\n",
    "\n",
    "print(word_average(stri))\n",
    "\n"
   ],
   "id": "d7b2d4203038b0e5",
   "outputs": [],
   "execution_count": null
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "3.\n",
    "Компьютер загадывает число от 1 до 100. Пользователь пытается угадать. После каждой попытки компьютер говорит «больше», «меньше» или «угадал». В конце вывести количество попыток."
   ],
   "id": "1f388f68cfbbb7a6"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "source": [
    "import random\n",
    "\n",
    "def tree_of_choice():\n",
    "    num2 = random.randint(0, 100)\n",
    "    print(num2)\n",
    "    num1 = int(input('Введите число'))\n",
    "    while num1 != num2:\n",
    "        if num1 > num2:\n",
    "            print('Больше!')\n",
    "            num1 = int(input())\n",
    "        elif num1 < num2:\n",
    "            print('Меньше!')\n",
    "            num1 = int(input())\n",
    "    print('Угадал!')\n",
    "\n",
    "tree_of_choice()"
   ],
   "id": "56443d18b519eb06",
   "outputs": [],
   "execution_count": null
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "4.\n",
    "Напишите программу «Таймер». Пользователь вводит количество секунд. Программа отсчитывает время, каждую секунду выводя оставшееся время в формате MM:SS. По истечении времени выводится сообщение и проигрывается звуковой сигнал (print('\\a'))."
   ],
   "id": "73c574b1da6e16c6"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "source": [
    "import time\n",
    "import datetime\n",
    "\n",
    "def timer():\n",
    "    seconds = int(input('Введите количество секунд'))\n",
    "\n",
    "    while seconds > 0:\n",
    "        user_time = datetime.time(0, seconds//60, seconds % 60)\n",
    "        form_time = user_time.strftime('%M:%S')\n",
    "\n",
    "        print(form_time + \"     \", end='\\r')\n",
    "        time.sleep(1)\n",
    "        seconds -= 1\n",
    "\n",
    "    return \"\\aЗвуковой сигнал\"\n",
    "\n",
    "print(timer())"
   ],
   "id": "ff24377e11e6ba4a",
   "outputs": [],
   "execution_count": null
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "5. Напишите функцию calculate(expression), которая принимает строку вида \"3 + 5 * 2\" (поддерживаются +, -, *, /, ^ для степени) и возвращает результат с учётом приоритета операций. Используйте обратную польскую запись или рекурсивный спуск. eval использовать нельзя.",
   "id": "1ca3561fa79b1deb"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "source": "",
   "id": "dc852d8d7c02616a",
   "outputs": [],
   "execution_count": null
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "",
   "id": "74fe8dae2e16d152"
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
